[
    {
        "code": "ARSC116",
        "title": "FYS: Strategies for Academic Success",
        "credit": "1",
        "description": "Provides first semester students in the Associate in Arts Program with the social and academic skills for university success. Topics include UD resources, study skills, and major exploration.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "BHAN135",
        "title": "Freshman Seminar",
        "credit": "2",
        "description": "Covers basic survival skills: effective coping strategies to meet personal,academic, career and social challenges. Enhances student success and developspositive lifelong learning skills",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "BMEG101",
        "title": "Introduction to Biomedical Engineering",
        "credit": "2",
        "description": "Introduces first year students to college life and provides a learning experience vital to their success at the University, in Engineering, and in Biomedical Engineering. Course content includes that of the university First Year Seminar, technical skills for engineers, and career opportunities in biomedical engineering",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "BUAD110",
        "title": "Basics of Business",
        "credit": "3",
        "description": "Introduction to business for majors to inform them about each of the functional areas of business through lectures, readings, discussions, guest speakers, cases and projects. Includes topics relating to operations, marketing, finance, management, accounting and management information systems, as well as business ethics, and critical thinking and decision making",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "EDUC100",
        "title": "Introduction to Elementary and Middle School Education",
        "credit": "2",
        "description": "First year seminar covers issues in K-8 learning and instruction. Topics include overviews of discipline options within the ETE major and examinations of K-8 education practices. Ethics/academic honesty, responsible use of technology, academic policies, diversity, and safety and wellness are addressed.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "EGGG101",
        "title": "Introduction to Engineering",
        "credit": "2",
        "description": "Introduction to profession, including disciplines of chemical, civil, computer, electrical, environmental, and mechanical engineering. Prepares students for success through integration of: technical problem solving and engineering design, ethical decision-making, teamwork, and communicating to diverse audiences.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "KAAP105",
        "title": "Freshman Seminar in Exercise Science",
        "credit": "1",
        "description": "Overview of University of Delaware resources, policies and intellectual culture. Introduces subdisciplines of the exercise science discipline: biomechanics, exercise physiology, and motor control, including familiarization with types of laboratory research and career opportunities.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "KAAP155",
        "title": "Lifestyle Awareness - Athletic Trainers",
        "credit": "3",
        "description": "Exploration into the basic principles of healthy lifestyle awareness for students seeking careers in health care. Serves as the First Year Experience (FYE) requirement for all Sports Health students.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "LLCU111",
        "title": "First Year Seminar: Intro to World Language Learning",
        "credit": "3",
        "description": "This course will encompass first-year seminar objectives, along with basic fundamentals of language learning.  Students will explore what it means to learn language collaboratively, and across a variety of contexts and will focus on students’ own language learning and its relationship to instruction.  Students will also participate in a field experience, visiting a local dual language immersion school. An alternate assignment will be given to those student for whom this observation proves a hardship",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "MAST100",
        "title": "Marine Science Colloquium I",
        "credit": "2",
        "description": "Broad introduction to academic life at the University of Delaware and the breadth of contemporary marine science research conducted in the field; introduces array of faculty research including biological, physical, chemical, geological marine science and marine policy. Mandatory day-long field trip to the UD Lewes campus for introduction to sampling techniques, coastal environments, and campus resources. Primarily intended for Marine Science Majors in the fall semester of their freshman year.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "NURS100",
        "title": "New Student Connections",
        "credit": "1",
        "description": "Provides first semester students in College of Health and Nursing Sciences opportunities to explore and become familiar with the college and university. Students acquire information on campus resources and gain practical skills helpful for a successful transition to college.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "UNIV 101",
        "title": "First Year Experience I",
        "credit": "1",
        "description": "The seminar is designed to help students adjust to college life. Led by faculty who will work closely with a peer mentor and others to help ensure that the first semester is successful and provides the foundation for your future success at UD. Opportunity for class discussion while utilizing the common reader, class assignments and university wide programming. Highlights our commitment at UD to being a community that recognizes and appreciates diversity and difference.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "CISC108",
        "title": "Introduction to Computer Science I",
        "credit": 3,
        "description": "Computing and principles of programming with an emphasis on systematic program design.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "CISC181",
        "title": "Introduction to Computer Science II",
        "credit": 3,
        "description": "Principles of computer science illustrated and applied through programming in an object oriented language.",
        "preReq": "CISC108",
        "taken": false
    },
    {
        "code": "CISC210",
        "title": "Introduction to Systems Programming",
        "credit": 3,
        "description": "Principles of computer systems programming for software and hardware platforms to achieve efficient resource usage.",
        "preReq": "CISC108",
        "taken": false
    },
    {
        "code": "CISC220",
        "title": "Data Structures",
        "credit": 3,
        "description": "Review of data type abstraction, recursion, arrays, stacks, queues, multiple stacks and linked lists. Emphasis on dynamic storage management, garbage collection, trees, graphs, tables, sorting and searching.",
        "preReq": "A minimum grade of C- in CISC 210",
        "taken": false
    },
    {
        "code": "CISC260",
        "title": "Machine Organization and Assembly Language",
        "credit": 3,
        "description": "Introduction to the basics of machine organization. Programming tools and techniques at the machine and assembly levels.",
        "preReq": "A minimum grade of C- in CISC 210",
        "taken": false
    },
    {
        "code": "CISC275",
        "title": "Introduction to Software Engineering",
        "credit": 3,
        "description": "Object oriented software design and development through use of an object oriented programming language.",
        "preReq": "Minimum grade of C- in CISC 181 and CISC 220",
        "taken": false
    },
    {
        "code": "CISC303",
        "title": "Automata Theory",
        "credit": 3,
        "description": "Automata and formal language theory. Background for advanced applications in compilers, computer networks, operating systems, and natural language processing.",
        "preReq": "A minimum grade of C- in both MATH 210 and CISC 220",
        "taken": false
    },
    {
        "code": "CISC320",
        "title": "Introduction to Algorithms",
        "credit": 3,
        "description": "Design and analysis of algorithms: worst/average case analysis, proofs for correctness and performance of algorithms.",
        "preReq": "MATH 210 and a minimum grade of C- in CISC 220",
        "taken": false
    },
    {
        "code": "CISC361",
        "title": "Operating Systems",
        "credit": 3,
        "description": "Principles and techniques employed in the development of operating systems and their control programs. Includes management of memory, processors, I/O devices.",
        "preReq": "MATH 210 and a minimum grade of C- in CISC 220",
        "taken": false
    },
    {
        "code": "CISC372",
        "title": "Parallel Computing",
        "credit": 3,
        "description": "Introduction to parallel computing concepts, methodologies, and tools. Programming and algorithmic techniques for code that will run simultaneously on parallel computing architectures.",
        "preReq": "C- or better in both CISC 220 and CISC 260",
        "taken": false
    },
    {
        "code": "CISC355",
        "title": "Computers, Ethics and Society",
        "credit": 3,
        "description": "Explains relationships among information technology, society and ethics by examining issues raised by increasingly widespread use of computers.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "CISC356",
        "title": "Intellectual Property in the Digital Age",
        "credit": 3,
        "description": "Explore economic, philosophical, social, and technical approaches to intellectual property.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "CISC357",
        "title": "Engaging Youth in Computing",
        "credit": 3,
        "description": "Develop communication, leadership, and teaching skills while working with youth to broaden participation in computing.",
        "preReq": "CISC108",
        "taken": false
    },
    {
        "code": "CISC465",
        "title": "Introduction to Cybersecurity",
        "credit": 3,
        "description": "This cybersecurity course is an introduction to computer and network security and covers the foundation security policies and methods to provide confidentiality, integrity, and availability, as well as cryptography, auditing, and user security.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "CISC498",
        "title": "Computer Science Senior Design Project I",
        "credit": 3,
        "description": "First semester of two-semester senior software design course.  Students work in teams to develop solutions to real-world problems for a client.",
        "preReq": "CISC 275 and CISC 320",
        "taken": false
    },
    {
        "code": "CISC499",
        "title": "Computer Science Senior Design Project II",
        "credit": 3,
        "description": "Second semester of two-semester senior software design course.",
        "preReq": "CISC 498",
        "taken": false
    }
]
