[
    {
        "code": "CISC108",
        "title": "Introduction to Computer Science I",
        "credit": 3,
        "description": "Computing and principles of programming with an emphasis on systematic program design.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "CISC181",
        "title": "Introduction to Computer Science II",
        "credit": 3,
        "description": "Principles of computer science illustrated and applied through programming in an object oriented language.",
        "preReq": "CISC108",
        "taken": false
    },
    {
        "code": "CISC210",
        "title": "Introduction to Systems Programming",
        "credit": 3,
        "description": "Principles of computer systems programming for software and hardware platforms to achieve efficient resource usage.",
        "preReq": "CISC108",
        "taken": false
    },
    {
        "code": "CISC220",
        "title": "Data Structures",
        "credit": 3,
        "description": "Review of data type abstraction, recursion, arrays, stacks, queues, multiple stacks and linked lists. Emphasis on dynamic storage management, garbage collection, trees, graphs, tables, sorting and searching.",
        "preReq": "A minimum grade of C- in CISC 210",
        "taken": false
    },
    {
        "code": "CISC260",
        "title": "Machine Organization and Assembly Language",
        "credit": 3,
        "description": "Introduction to the basics of machine organization. Programming tools and techniques at the machine and assembly levels.",
        "preReq": "A minimum grade of C- in CISC 210",
        "taken": false
    },
    {
        "code": "CISC275",
        "title": "Introduction to Software Engineering",
        "credit": 3,
        "description": "Object oriented software design and development through use of an object oriented programming language.",
        "preReq": "Minimum grade of C- in CISC 181 and CISC 220",
        "taken": false
    },
    {
        "code": "CISC303",
        "title": "Automata Theory",
        "credit": 3,
        "description": "Automata and formal language theory. Background for advanced applications in compilers, computer networks, operating systems, and natural language processing.",
        "preReq": "A minimum grade of C- in both MATH 210 and CISC 220",
        "taken": false
    },
    {
        "code": "CISC320",
        "title": "Introduction to Algorithms",
        "credit": 3,
        "description": "Design and analysis of algorithms: worst/average case analysis, proofs for correctness and performance of algorithms.",
        "preReq": "MATH 210 and a minimum grade of C- in CISC 220",
        "taken": false
    },
    {
        "code": "CISC361",
        "title": "Operating Systems",
        "credit": 3,
        "description": "Principles and techniques employed in the development of operating systems and their control programs. Includes management of memory, processors, I/O devices.",
        "preReq": "MATH 210 and a minimum grade of C- in CISC 220",
        "taken": false
    },
    {
        "code": "CISC372",
        "title": "Parallel Computing",
        "credit": 3,
        "description": "Introduction to parallel computing concepts, methodologies, and tools. Programming and algorithmic techniques for code that will run simultaneously on parallel computing architectures.",
        "preReq": "C- or better in both CISC 220 and CISC 260",
        "taken": false
    },
    {
        "code": "CISC355",
        "title": "Computers, Ethics and Society",
        "credit": 3,
        "description": "Explains relationships among information technology, society and ethics by examining issues raised by increasingly widespread use of computers.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "CISC356",
        "title": "Intellectual Property in the Digital Age",
        "credit": 3,
        "description": "Explore economic, philosophical, social, and technical approaches to intellectual property.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "CISC357",
        "title": "Engaging Youth in Computing",
        "credit": 3,
        "description": "Develop communication, leadership, and teaching skills while working with youth to broaden participation in computing.",
        "preReq": "CISC108",
        "taken": false
    },
    {
        "code": "CISC465",
        "title": "Introduction to Cybersecurity",
        "credit": 3,
        "description": "This cybersecurity course is an introduction to computer and network security and covers the foundation security policies and methods to provide confidentiality, integrity, and availability, as well as cryptography, auditing, and user security.",
        "preReq": "N/A",
        "taken": false
    },
    {
        "code": "CISC498",
        "title": "Computer Science Senior Design Project I",
        "credit": 3,
        "description": "First semester of two-semester senior software design course.  Students work in teams to develop solutions to real-world problems for a client.",
        "preReq": "CISC 275 and CISC 320",
        "taken": false
    },
    {
        "code": "CISC499",
        "title": "Computer Science Senior Design Project II",
        "credit": 3,
        "description": "Second semester of two-semester senior software design course.",
        "preReq": "CISC 498",
        "taken": false
    }
]
